// К1.1 Вежби
// Од тастатура се внесува цел број n, а потоа и n тројки природни броеви (должини на три отсечки).
// За секоја тројка должини треба да се испечати порака Moze ако со нив може да се конструира триаголник,
// во спротивно се печати Ne moze. На крај да се испечати редниот број на тројката броеви со која се
// конструира триаголникот со најголем периметар (се земаат предвид само тројките со кои може да се
// конструира триаголник), како и вредноста на најголемиот периметар. Ако постојат повеќе такви тројки броеви,
// да се испечати редниот број на последната. Се смета дека првата внесена тројка е со реден број еден, втората
// со реден број два итн.

#include <stdio.h>

int main() {
    int n, a, b, c, p = -1, indeks = -1, l;
    scanf("%d", &n);

    for(int i = 0; i < n; i++) {
        scanf("%d %d %d", &a, &b, &c);

        if(!((a + b) > c && (a + c) > b && (b + c) > a)) {
            printf("Ne moze\n");
            continue;
        }

        l = a + b + c;
        if(l > p) {
            p = l;
            indeks = i + 1;
        }

        printf("Moze\n");
    }

    printf("Najgolemiot perimetar: %d, reden broj %d.", p, indeks);
    return 0;
}
