// Labs 2.3 - 31/10/2022
// Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:
// - индекс (шестцифрен цел број)
// - шест оценки од последниот семестар кој го слушал
//
// Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот:
// - просек на студентот (просекот да се испечати со точност од 3 децимали)
// - година на студии (студентите чијшто индекс почнува на 21 се втора година, 20 се трета година, 19 се четврта година итн.)
// - дали е награден (1 = награден, 0 = не е награден) - Еден студент се наградува доколку има просек еднаков или поголем од 9.5

#include <stdio.h>

int main() {
    int indeks, oceni = 0, n;
    scanf("%d", &indeks);
    
    for(int i = 0; i < 6; i++) {
        scanf("%d", &n);
        oceni += n;
    }
    
    int godina = (indeks / 10000) % 100;
    float prosek = (oceni) / 6.0;
    
    printf("Prosek: %.3f\n", prosek);
    printf("Student: %d\n", indeks);
    printf("%d godina\n", (22 - godina) + 1);
    printf("Nagraden: %d", prosek >= 9.5 ? 1 : 0);
    
    return 0;
}
