// 3.3
// Од тастатура се чита еден 2-цифрен број. Да се формира број чиј што цифри ќе бидат подредени од десно кон лево во растечки редослед
// и да се испечати на екран неговиот степен.
// Пример: Од бројот 12 треба да се формира бројот 21 и да се испечати на екран неговиот степен (441).
// Напомена: Бројот секогаш ќе е двоцифрен.

#include <stdio.h>

int main() {
    int n, r;
    scanf("%d", &n);
    
    int prva = n % 10, vtora = n / 10;
    
    if(prva >= vtora) { r = prva * 10 + vtora; }
    else { r = vtora * 10 + prva; }

    printf("%d", r * r);
    return 0;
}
