// 3.2
// Од тастатура се внесуваат 3 производи во формат: цена, тип на данок, каде што цената е внесена како цел број, додека типот на данок се внесува како мала или голема буква, и притоа
// - тип A или a изнесува 18%
// - тип B или b изнесува 5%
// - тип V или v изнесува 0%
//
// Да се испечати вкупното ДДВ кое што треба да се плати за тие производи. ДДВто се пресметува како процент од цената на самиот производ.

#include <stdio.h>

int main() {
    int n;
    char tip;
    float ddv = 0.0;

    for(int i = 0; i < 3; i++) {
        scanf("%d %c", &n, &tip);
        if(tip == 'A' || tip == 'a') { ddv += (n * 0.18); }
        else if(tip == 'B' || tip == 'b') { ddv += (n * 0.05); }
    }

    printf("%.2f", ddv);
    return 0;
}
