// 7.1
// Од стандарден влез да се прочита квадратна матриција со број на редици и колони N. Прво се вчитува бројот N а потоа и N*N елементите на матрицата.
// Да се промени знакот на елементите од главната дијагонала на матрицата (позитивните да станат негативни и обратно). 
// Да се испечати трансформираната матрица на екран (Секој елемент од матрицата се печати со 3 места - %3d).

// Може и без матрица... ама морало вака.
#include <stdio.h>

int main() {
    int n, broj;
    scanf("%d", &n);

    int a[100][100];

    if(n > 100) return 0;

    for(int i = 0; i < n; i++) {
        for(int j = 0; j < n; j++) {
            scanf("%d", &a[i][j]);
        }
    }

    for(int i = 0; i < n; i++) {
        for(int j = 0; j < n; j++) {
            printf("%3d ", i == j ? -a[i][j] : a[i][j]);
        }
        printf("\n");
    }

    return 0;
}
