// 7.3
// Од стандарден влез се вчитува матрица сo n редици и n колони. Прво се вчитува бројот n потоа и елементите на матрицата.
// Матрицата треба да се трансформира така што секој елемент што се наоѓа десно од споредната дијагонала од истата редица и
// е помал од просекот на елементите лево од споредната дијагонала од истата редица треба да се замени со -1.
// Вака трансформираната матрица да се испечати на екран.

#include <stdio.h>

int main() {
    int n, broj;
    scanf("%d", &n);

    int a[100][100];

    for(int i = 0; i < n; i++) {
        for(int j = 0; j < n; j++) {
            scanf("%d", &a[i][j]);
        }
    }

    for(int i = 0; i < n; i++) {
        float suma = 0, ct = 0;

        for(int j = 0; j < n - i - 1; j++) {
            suma += a[i][j];
            ct++;
        }

        for(int j = n - 1; j > n - i - 1; j--) {
            a[i][j] = a[i][j] < (suma / ct) ? -1 : a[i][j];
        }
    }

    for(int i = 0; i < n; i++) {
        for(int j = 0; j < n; j++) {
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }

    return 0;
}
