// 5.2
// Даден е правоаголник кој се наоѓа во првиот квадрант од координатниот систем и страните му се паралелни со оските.
// Правоаголникот се задава со координатите на долното лево и горното десно теме (темињата А и С) кои се цели броеви.
// Потоа, се внесуваат координатите на две точки. Вашата програма за секоја од двете точки на излез треба да отпечати DA,
// ако дадената точка лежи врз правоаголникот (во правоаголникот и на страните) и NE ако е надвор од него.

#include <stdio.h>

int main() {
    int ax, ay, cx, cy, x, y;
    scanf("%d %d %d %d", &ax, &ay, &cx, &cy);

    for(int i = 0; i < 2; i++) {
      scanf("%d %d", &x1, &y1);
      
      if(x >= ax && x <= cx && y >= ay && y <= cy) printf("DA\n");
      else printf("NE\n");
    }

    return 0;
}
