// 6.2
// Од стандарден влез се чита позитивен број n кој ги дава димензиите на квадратна матрица од цели броеви, која се чита во продолжение.
// Да се напише програма која за таа матрица(макс. 100 x 100) ќе ја испечати должината на најдолгата строго растечка подниза, доколку матрицата ја гледаме ред по ред.
//
// На пример, ако е дадена следната матрица:
// 1 2 3 9 8
// 5 5 5 5 5 
// 0 1 2 0 0 
// 9 1 2 3 4 
// 1 1 1 1 1
// должината на најдолгата строго растечка подниза е 4, а тоа е должината на поднизата 1 2 3 4, во четвртиот ред.

#include <stdio.h>

int main() {
    int n, indeks = 0;
    scanf("%d", &n);

    if(n > 100) { return 0; }

    for(int i = 0; i < n; i++) {
        int niza[100], pomosh = 0;

        for(int j = 0; j < n; j++) { scanf("%d", &niza[j]); }

        for(int k = 0; k < n - 1; k++) {
            if(niza[k] < niza[k + 1]) {
                pomosh++;
                if(pomosh > indeks) indeks = pomosh;
            }
        }
    }

    printf("%d", indeks + 1);

    return 0;
}
